brew "fzf"
brew "rg"
brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "fish"
brew "tmux"
brew "reattach-to-user-namespace"
brew "neovim"
brew "curl"
brew "rig"
brew "autossh"
brew "pinentry-mac"
brew "npm"
brew "ruby"

brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

tap "homebrew/cask"
cask_args require_sha: true

cask "1password"
cask "keybase"
cask "tunnelblick"
cask "font-fontawesome"
cask "vimr"
cask "google-chrome"
cask "slack"
cask "vlc"
cask "appcleaner"
cask "plex-media-player"
cask "spotify"
cask "zoomus"
cask "calibre"
cask "hammerspoon"
cask "tableplus"
cask "cyberduck"
cask "iterm2"
cask "the-unarchiver"
cask "disk-inventory-x"
cask "karabiner-elements"
cask "tor-browser"
cask "dash"

tap "homebrew/cask-fonts"
cask "font-fira-code"
