brew "fzf"
brew "pandoc"
brew "jq"
brew "htop"
brew "tree"
brew "delta"
brew "rg"
brew "bat"
brew "diff-so-fancy"
brew "fd"
brew "fish"
brew "tmux"
brew "reattach-to-user-namespace"
brew "neovim"
brew "gnupg"
brew "pinentry-mac"
brew "curl"
brew "rig"
brew "autossh"
brew "npm"
brew "ruby"
brew "python"  # This is required so that pip install to homebrew Python's directory
brew "blueutil"
brew "cmake"
brew "rga"

tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

tap "homebrew/cask"
cask_args require_sha: false

cask "google-chrome"
cask "spotify"

cask_args require_sha: true

cask "vimr"
cask "slack"
cask "vlc"
cask "appcleaner"
cask "plex-media-player"
cask "calibre"
cask "hammerspoon"
cask "iterm2"
cask "the-unarchiver"
cask "disk-inventory-x"
cask "karabiner-elements"
cask "dash"
cask "secretive"
cask "stats"

tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
